export const hintsTitleHard = {
  0: 'Не требуется',
  1: 'Минимальный опыт использования',
  2: 'Выполняеться частично',
  3: 'Выполняется полностью',
  4: 'Превосходит ожидания',
};

export const hintsDescriptionHard = {
  0: 'Данный индикатор поведения не актуален для выполнения текущих задач, не оценивается в данной роли или не проявлен.',
  1: 'Требуется значительное развитие компетенции и поддержка для уверенности и эффективности',
  2: 'Сотрудник демонстрирует базовые навыки в данной области, однако требуется помощь более опытных коллег или руководителя.',
  3: 'Сотрудник уверенно проявляет необходимые навыки, самостоятельно выполняет задачи средней сложности и вносит предложения по улучшению процессов.',
  4: 'Сотрудник демонстрирует высокий уровень мастерства, эффективно решает сложные задачи, может выступать наставником.',
};

export const hintsTitleSoft = {
  0: 'Не могу оценить ',
  1: 'Совсем не характерно',
  2: 'Проявляется крайне редко',
  3: 'Проявляется время от времени',
  4: 'Проявляется всегда',
  5: 'Является эталоном',
};

export const hintsDescriptionSoft = {
  0: 'Нет информации для оценки, не могу оценить.',
  1: 'Сотрудник никогда не демонстрирует данное поведение.',
  2: 'Сотрудник не стабильно демонстрирует в работе данное поведение. Может проявлять под давлением.',
  3: 'Сотрудник не всегда демонстрирует поведение (от случая к случаю). В нетипичных (сложных) ситуациях может испытывать затруднения.',
  4: 'Сотрудник демонстрирует в работе данное поведение в стандартных (знакомых) ситуациях.',
  5: 'Сотрудник всегда демонстрирует поведение, описанное в индикаторе. Умело использует его, в том числе в нетипичных, нестандартных ситуациях, и может являться образцом для подражания в этом поведении.',
};
